import unittest

from cinema_recomandathion import MovieRecommendation
from social_question import main


class MovieRecommendationTests(unittest.TestCase):
    def setUp(self):
        self.movies_file = 'cinema.txt'
        self.history_file = 'cinema_history.txt'
        self.recommendation = MovieRecommendation(self.movies_file, self.history_file)
        self.main = main()
    def test_social(self):
        s1 = "18 25 35 45 60 80 100" + "\n" +\
             "Кириллов Юрий Михайлович,67" + "\n" +\
             "Сергей Владимир Андреевич,89" + "\n" +\
             "Корнилов Семён Кириллович,53" + "\n" +\
             "Мизулин Корней Алексеевич,36" + "\n" +\
             "Крутовский Алексей Юрьевич,14" + "\n" +\
             "Воскресенский Николай Николаевич,24" + "\n" +\
             "END"
        s2 = "81-100: Сергей Владимир Андреевич (89)" + "\n" +\
             "61-80: Кириллов Юрий Михайлович (67)" + "\n" +\
             "46-60: Корнилов Семён Кириллович (53)" + "\n" +\
             "36-45: Мизулин Корней Алексеевич (36)" + "\n" +\
             "19-25: Воскресенский Николай Николаевич (24)"
        self.assertEqual(self.main(s1), s2)
        s1 = "18 25 35 45 60 80 100" + "\n" + \
             "Кириллов Юрий Михайлович,27" + "\n" + \
             "Сергей Владимир Андреевич,49" + "\n" + \
             "Корнилов Семён Кириллович,83" + "\n" + \
             "Мизулин Корней Алексеевич,26" + "\n" + \
             "Крутовский Алексей Юрьевич,44" + "\n" + \
             "Воскресенский Николай Николаевич,64" + "\n" + \
             "END"
        s2 = "81-100: Корнилов Семён Кириллович (83)" + "\n" + \
             "61-80: Воскресенский Николай Николаевич (64)" + "\n" + \
             "46-60: Сергей Владимир Андреевич (49)" + "\n" + \
             "36-45: Крутовский Алексей Юрьевич (44)" + "\n" + \
             "19-25: Кириллов Юрий Михайлович (27), Мизулин Корней Алексеевич (26)"
        self.assertEqual(self.main(s1), s2)
        s1 = "18 25 35 45 60 80 100" + "\n" + \
             "Кириллов Юрий Михайлович,67" + "\n" + \
             "Сергей Владимир Андреевич,79" + "\n" + \
             "Корнилов Семён Кириллович,53" + "\n" + \
             "Мизулин Корней Алексеевич,46" + "\n" + \
             "Крутовский Алексей Юрьевич,84" + "\n" + \
             "Воскресенский Николай Николаевич,94" + "\n" + \
             "END"
        s2 = "81-100: Крутовский Алексей Юрьевич (84), Воскресенский Николай Николаевич (94)" + "\n" + \
             "61-80: Кириллов Юрий Михайлович (67), Сергей Владимир Андреевич (79)" + "\n" + \
             "46-60: Корнилов Семён Кириллович (53), Мизулин Корней Алексеевич (46)"
        self.assertEqual(self.main(s1), s2)
    if __name__ == '__main__':
        unittest.main()

